class Solution:
	"""
		@问题：给定一个正整数 1 <= K <= 1e5, 找到最小的 11111...111 使得能被 K 整除
		@例子：when K = 3, return 3 because 111 is the smallest 
		@思路：111 % 3 = ((11 % 3) * 10 + 1) % 3 = (2*10 + 1) %3 = 0
		------------------------------------------------------------
		K = 123, 总共有122种除了0之外的余数，那么只需要从 1 开始，不断取余 即可
		------------------------------------------------------------

		i 	0	1	2		3				...		11	12	13
		r 	1	11	111		(1111)%123 = 4	...		93  70  86
		$ r' = (10 * r + 1) % K         
	"""
    def smallestRepunitDivByK(self, K: int) -> int:
        
        if K % 2 == 0 or K % 5 == 0: 
            return -1
        
        r = 0
        for i in range(K):
            r = (10 * r + 1) % K
            if r == 0: 
                return i+1
        
        return -1