class Solution:
    """
    问题： 给定 buildings = [[2 9 10], [3 7 15], [5 12 12], [15 20 10], [19 24 8]]
               [2 9 10] 分别代表建筑的 左边X 右边X 和 高度，所以这个是横跨[2,9]高度为10的建筑
    问题： 标出天际线， [[2 10], [3 15], [7 12], [12 0], [15 10], [20 8], [24, 0]] [x,y]
    详细： 参考这篇博文 https://blog.csdn.net/qq_17550379/article/details/102757308

    思路： 扫描法，从左到右搞一个最小堆，最高建筑放第一个，
        : 当最高建筑右边X超出扫描范围，弹出
        : 把新的建筑放入最小堆中 (按 高度 右边X 排列)
        : 结果总是保留当前最高建筑
    --------------------------------------------------------------------------------------
    例子： 
            buildings = [[2 9 10], [3 7 15], [5 12 12], [15 20 10], [19 24 8]]
            (L,-H, R) = [[2 -10 9], [3 -15 7], [5 -12 12], [15 -10 20], [19 -8 24]]
            (R, 0, 0) = [[9 0 0], [7 0 0], [12 0 0], [20 0 0], [24 0 0]]
    更新： res[-1] 始终 keep highest 
    --------------------------------------------------------------------------------------
    scan: [(2, -10, 9), (3, -15, 7), (5, -12, 12), (7, 0, 0), (9, 0, 0), (12, 0, 0), 
           (15, -10, 20), (19, -8, 24), (20, 0, 0), (24, 0, 0)]
    iter @   heap [height, rightx]                           res [leftx, height]
    1        [(-10, 9), (0,inf)]                             [[0, 0], [2, 10]]
    2        [(-15, 7), (0, inf), (-10, 9)]                  [[0, 0], [2, 10], [3, 15]]
    3        [(-15, 7), (-12, 12), (-10, 9), (0, inf)]       [[0, 0], [2, 10], [3, 15]]
    4        [(-12, 12), (0, inf), (-10, 9)]                 [[0, 0], [2, 10], [3, 15], [7, 12]]
    5        scan [9 0 0 ] 并不更新 heap 也不更新 result
    6        scan [12 0 0] heap要被清空只剩下(0, inf), 更新res[-1]=[12 0]
    7        scan [15 -10 20]  把(height=10, xright=20)加到堆里 更新res[-1]=[15 10]
    8        scan [19 -8 24]   把(height=8, xright=24)加到堆里  不用更新res
    9        scan [20 0 0]     把(-10,20)从堆里弹出来, 更新res[-1] = [20 8(来自建筑(19 24 8))]
    10       scan [24 0 0]     把(-8, 24)从堆里弹出来, 更新res[-1] = [24 0(来自最开始的(0 inf))]
    ---------------------------------------------------------------------------------------
    详细解释： 加 (xright, 0, 0) 是为了引发更新(天际线瞬间下降), 堆始终维持最高建筑（heapinsert完成）
              当最高建筑发生变化时, 判断天际线变化. 放[0,0]是为了更新第一个天际线
    """
    def getSkyline(self, buildings: List[List[int]]) -> List[List[int]]:
        points = [(L, -H, R) for L, R, H in buildings] + [(R, 0, 0) for R in set(r for _, r, _ in buildings)]
        points.sort()
        heap, res = [(0, float('inf'))], [[0, 0]]
        for l, nh, r in points:
            while heap[0][1] <= l:
                heapq.heappop(heap)
            if nh:
                heapq.heappush(heap, (nh, r))
            if res[-1][1] != -heap[0][0]:
                res += [[l, -heap[0][0]]]
        return res[1:]
        